# GetAdditionalInformation Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IUpdater..::..GetAdditionalInformation Method
IUpdater Interface See Also
---
Auxiliary text that Revit will use to inform the end user when the Updater is not loaded
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
string GetAdditionalInformation()
```

Visual Basic
---
```text
Function GetAdditionalInformation As String
```

Visual C++
---
```text
String^ GetAdditionalInformation()
```

# See Also
IUpdater Interface
Autodesk.Revit.DB Namespace